Revit 2024 API
BuiltInFailures.FamilyFailures.FamilyConnectorDeletedError Property
 The family Connector has been modified so the connection is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FamilyConnectorDeletedError { get; }
Visual Basic
Public Shared ReadOnly Property FamilyConnectorDeletedError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FamilyConnectorDeletedError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace